Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: སྦྱིན་སྲེག་ཆོ་གར་འདིར་བཞག་སྟེ།
en: He should place them as required for the homa rite and offer them into the fire.

source: །དུས་གསུམ་རྟག་ཏུ་རེག་འཛིན་གྱིས། །སྦྱིན་སྲེག་བརྒྱ་རྩ་བརྒྱད་དུ་བྱ།
en: This should always be done one hundred and eight times at the three junctions of the day.

source: །རིགས་པ་འཛིན་པ་གཙང་མ་ཡིས། །གཙང་མ་ཡི་ནི་གོས་བགོས་ལ། །དཀར་གསུམ་གྱི་ནི་ཟས་བཟའ་ཞིང་།
en: The vidyā holder should maintain ritual purity, wear clean clothes, and subsist on the three ‘white’ foods.

source: །གཞན་ནི་བཟའ་དང་སྤྱད་མི་བྱ།
en: He must not partake of other food. “

source: །དཀྱིལ་འཁོར་གྱི་ནི་ནུབ་སྒོ་ནས། །དཀྱིལ་འཁོར་ཤེས་པ་འཇུག་བྱ་ཞིང་། །དར་བྷའི་སྟན་ལ་སྐྱིལ་ཀྲུང་དུ། །ཤར་ཕྱོགས་ཁ་བལྟས་འདུག་པར་བྱ།
en: The vidyā holder who knows the maṇḍala rite should enter the maṇḍala through the western gate and sit down facing east in a cross-legged position on a seat of darbha grass.

source: །བྱམས་པའི་སེམས་ལ་མཉམ་བཞག་སྟེ། །དོན་ཡོད་རྒྱལ་པོ་དྲན་བྱ་ཞིང་། །སྔ་དྲོའི་དུས་སུ་སྦྱིན་སྲེག་བྱ།
en: Before noon, he should assume a loving frame of mind, mindfully repeat the Amogharāja, and perform the homa rite.

source: །གུང་ལ་སློམ་མ་གཞུག་བྱ་ཞིང་།
en: At midday he should bring his disciples into the maṇḍala.

source: །སྤྱི་ཡི་རིགས་ཀྱི་སྲེག་བླུགས་ནི། །ཕྱེ་མ་རེད་དུས་སུ་བྱ་བའོ།
en: In the afternoon he should perform the homa rite that is shared by all the families.

source: །གང་ཞིག་དཀྱིལ་འཁོར་དུ་ཞུགས་ལ། །སྦྱིན་སྲེག་དཀྱིལ་འཁོར་དེ་ཉིད་དང་།
en: Those who enter this true homa maṇḍala will be successful in every way.

source: །གྲུབ་པ་ཀུན་དུ་ཆོ་ག་ཡི།
en: The procedure will also effect self-consecration.

source: །བདག་ཉིད་དབང་བསྐུར་མེ་ཀུན་གྱི། །སྦྱིན་སྲེག་བྱེད་པའི་མཆོག་ཏུ་གསུངས། །ཀུན་དུ་གནས་ནི་ཐམས་ཅད་ན།
en: Among all fire offerings, this one is said to be supreme in every respect. “

source: །རྒྱས་པ་གནས་འཇོག་རྭ་གཅིག་དང་།
en: The most prominent among all fire priests are said to abide everywhere.

source: །གར་གེ་དེ་བཞིན་ཕུར་བུ་དང་། །མདུན་ན་འདོན་པ་མེ་ལྷ་ནི། །སྦྱིན་སྲེག་བྱེད་པ་འཇིག་རྟེན་པར།
en: The chief priests Vyāsa, Vasiṣṭha, Ekaśṛṅga, Mārgāgeya, and Bṛhaspati are the same as the worldly fire priests.

source: །མཚུངས་ཞེས་སྟོན་པས་ལུང་བསྟན་ཏོ། །འཇིག་རྟེན་འདས་པའི་ལས་སྒྲུབ་པ། །རིག་འཛིན་དབང་པོ་ཆེན་པོ་དང་། །ཕྱག་ན་རྡོ་རྗེ་ཚངས་པ་དང་། །ཁྱབ་འཇུག་དབང་ཕྱུག་ཆེན་པོ་དང་།
en: But those declared by the Teacher to accomplish supramundane rites and activities are the great vidyādhara Vajrapāṇi, Indra, Brahmā, Viṣṇu, and Maheśvara.

source: །མཉམ་པ་བས་ཀྱང་ལྷག་པ་ཉིད། །མེ་ཡིས་སྦྱིན་སྲེག་བྱེད་པ་ལ། །དེ་བཞིན་གཤེགས་ཀུན་བྱིན་གྱིས་རློབ།
en: Blessed by all the tathāgatas, they are superior to ordinary fire priests. “

source: །གལ་ཏེ་ཞག་བདུན་དུས་གསུམ་དུ། །དེ་ལ་སོགས་པའི་ལས་རྣམས་ནི། །མེ་ལ་སྦྱིན་སྲེག་བྱེད་པ་ལ། །མོད་ལ་མངོན་ཤེས་ལྔ་ཐོབ་ཅེས། །དེ་སྐད་འཇིག་རྟེན་འདྲེན་པ་གསུང་།
en: The vidyā holder who performs this and the following rites that involve fire sacrifice for seven days at the three junctions of the day will instantly obtain the five superknowledges, as declared by the guide of the world.

source: །ལས་ནི་བྱས་ནས་དེ་ནས་ནི། །སྦྱིན་སྲེག་ལ་ནི་བརྩམ་པར་བྱ། །སྲེག་བླུགས་སྦྱིན་སྲེག་བྱས་ཙམ་གྱིས།
en: After performing the preparatory rites, he should commence the homa rite.

source: །ལས་རྣམས་ཐམས་ཅད་འགྲུབ་པར་འགྱུར། །ལྷ་རྣམས་རྟག་ཏུ་འོང་འགྱུར་ཞིང་། །དེ་བཞིན་གཤེགས་ཀུན་དགྱེས་པར་འགྱུར། །བྱང་ཆུབ་སེམས་དཔའ་བྱོན་ནས་ནི། །མོད་ལ་མཐོང་བའི་སྦྱིན་པར་མཛད།
en: Through this homa offering alone he will accomplish all activities, devas will always approach him, all tathāgatas will be pleased with him, and bodhisattvas will instantly arrive and appear before him to grant boons.

source: །སྡིག་པ་ཐམས་ཅད་བསྲེག་པར་འགྱུར། །ཤིན་ཏུ་མི་བཟད་སྔོན་གྱི་ལས། །སྲེག་བླུགས་ཙམ་གྱི་མོད་ལ་བསྲེགས། །འབར་བའི་མེ་ཡིས་ཕྱེ་ལེབ་བཞིན།
en: All his wrongdoings and dreadful past karma will be completely incinerated as soon as the homa is offered, burning immediately like a moth in a blazing fire.

source: །དེ་ལ་སོགས་པའི་སྡིག་པ་ནི། །བསྲེག་འགྱུར་འདིར་ནི་ཐེ་ཚོམ་མེད། །སྡང་བའི་ཕྱིར་ནི་རྒོལ་ཉིད་དང་།
en: This and other evils will burn; there is no doubt about this.

source: །མི་བཟད་ཕས་ཀྱི་དགྲ་རྣམས་དང་། །ཕ་རོལ་དཔུང་གིས་འཇིགས་པ་ཉིད། །དེ་བཞིན་དུ་ཡང་རྒྱལ་པོའི་དཔུང་། །དེ་ཀུན་སྦྱིན་སྲེག་བྱས་ཙམ་གྱིས། །མི་སྣང་བར་འགྱུར་ཐེ་ཙོམ་མེད།
en: Wicked opponents and adversaries and the terrible dangers posed by enemy armies and powerful kings will all disappear, without a doubt, as soon as the homa is performed. “

source: །དེ་བཞིན་མི་ངས་གཅོང་ཀུན་དང་། །ནད་ཀུན་རབ་ཏུ་ཞི་བར་འགྱུར། །མུ་གེའི་དགོན་པའི་འཇིགས་ཉིད་ཀྱང་།
en: All diseases and life-threatening ailments will be pacified.

source: །སྦྱིན་སྲེག་བྱས་པ་ཙམ་གྱིས་འཇིག །གནོད་སྦྱིན་སྲིན་པོ་འབྱུང་པོ་དང་། །དེ་བཞིན་བགེགས་དང་ལོག་འདྲེན་དང་། །ཤ་ཟ་བརྗེད་བྱེད་ཡི་དགས་དང་། །དེ་བཞིན་རྣམ་པ་སྣ་ཚོགས་གདོན།
en: By merely performing the homa, the danger of famine and other calamities will be removed, as will the danger posed by yakṣas, rākṣasas, bhūtas, vighnas, vināyakas, piśācas, apasmāras, pretas, grahas, and various other beings.

source: །འདི་ཀུན་སྦྱིན་སྲེག་བྱས་ཙམ་གྱིས། །འཇིག་པར་འགྱུར་བར་ཐེ་ཙོམ་མེད།
en: They will all perish as soon as the homa is performed; there is no doubt.

source: །རྟག་ཏུ་འཇིགས་མེད་ལོ་ལེགས་ཤིང་། །གླིང་དང་བདེ་བར་འགྱུར་བ་ཡིན།
en: Peace and prosperity will always reign on the continents, and there will be no fear or danger.

source: །རྟག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ནི། །ཀུན་ཏུ་རྒྱལ་བར་འགྱུར་བ་ཡིན།
en: All beings will always be victorious in every respect.

source: །རྒྱལ་པོ་དཔུང་དང་བཅས་པ་ཉིད། །བཙུན་མོར་བཅས་པ་ཉིད་ཀྱང་ནི། །རྟག་པར་ཀུན་ཏུ་གསལ་བར་ནི། །མི་འཇིགས་སྦྱིན་པར་ཐེ་ཙོམ་མེད།
en: The kings with their armies and harems will all protect their subjects from danger and will always thrive; there is no doubt.

source: །རྟག་ཏུ་ནད་མེད་འགྱུར་བ་དང་། །དགའ་ཞིང་ཡིད་ནི་བདེ་བ་དང་། །ལུས་ཅན་དག་ནི་ཐམས་ཅད་ལ། །རྟག་ཏུ་དགའ་བར་བྱེད་ཅིང་གནས།
en: All embodied beings will remain free from disease and enjoy a happy, pleasant existence, their wishes fulfilled. “

source: །རྟག་ཏུ་མེ་ཡི་ལྷ་ཉིད་ནི། །རྒྱུན་དུ་མཐོང་བར་འདོད་པ་ཡིས།
en: The fire deity will always appear to those who desire to see him continually.

source: །མེ་ལ་སྦྱིན་སྲེག་བྱས་ཙམ་གྱིས། །མེ་ལྷ་ཉིད་ནི་བཞུགས་གྱུར་ཏེ། །རྟག་ཏུ་ལས་རྣམས་ཐམས་ཅད་མཛད། །རྒྱུན་དུ་ཕྱི་བཞིན་འབྲང་བར་འགྱུར།
en: As soon as the oblation is offered, the fire deity will become the vidyā holder’s servant and will always follow him to perform all his tasks.

source: །ལྷ་ནི་རྟག་ཏུ་འོང་འགྱུར་ཞིང་། །ཐམས་ཅད་དུ་ནི་མཐོང་བ་སྟེར། །རྒྱུ་སྐར་ཟླ་བ་ཉི་མ་དང་།
en: Deities will always arrive and will appear to him at all times.

source: །གཤིན་རྗེ་དང་ནི་ཆུ་ལྷ་དང་། །རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག །དཔུང་བཅས་བཞོན་པར་བཅས་པ་ཡང་། །ཉིན་དང་མཚན་དུ་རྟག་པར་ནི། །རྗེས་འབྲང་བསྲུང་འགྱུར་ཐེ་ཙོམ་མེད།
en: The nakṣatras, Candra, Sūrya, Yama, Varuṇa, and the Four Great Kings with their armies and mounts will always follow him and protect him day and night.

source: །ཅི་སྟེ་རིག་སྔགས་འཆང་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་བསྒྲུབ་པར་འདོད་ན་རིག་སྔགས་འཆང་གཙང་མ་དེས་ཤིན་ཏུ་ཁྲུས་བྱས་ལ་གོས་གཙང་མ་བགོ་བར་བྱ།
en: There is no doubt about this. “If the vidyā holder wants to accomplish the heart essence of Amogharāja, he should maintain ritual purity, bathe thoroughly, and wear clean clothes.

source: ཉིན་ཞག་གཅིག་སྨྱུང་བ་བྱ་ཞིང་། ཤིང་ཨརྒའི་ཡམ་སྲེག་ཤིང་གི་མེ་སྦར་ལ་པདྨ་དང་། ཞུན་མར་དང་།
en: Having fasted for one day and one night, he should light the fire using sticks of giant milkweed and offer one hundred and eight homas of rice grains and lotuses smeared with ghee.

source: འབྲས་སོ་བའི་སྦྱིན་སྲེག་བརྒྱད་བརྒྱ་བྱས་ནས་སྲེག་བླུགས་ལན་ཅིག་བྱས་པས་མཚམས་མེད་པ་ལྔ་བྱེད་པ་ཡང་འགྲུབ་པར་འགྱུར་ཏེ།
en: He will succeed in purifying even the five acts of immediate retribution with as little as a single homa.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱིའི་རིགས་ཀྱི་དངོས་གྲུབ་འདོད་ན་རིག་སྔགས་འཆང་དེས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་མེ་སྦར་ལ་རིགས་སྤྱིར་པདྨ་དང་། །ཨུཏྤ་ལ་སྔོན་པོ་དང་། ཡུངས་ཀར་དཀར་པོ་དང་།
en: If the vidyā holder wants to accomplish the sameness of all tathāgata families, he should light sticks of bodhi tree and offer one hundred and eight homas of pink lotuses, blue lotuses, and white mustard seeds, all daubed with ghee.

source: །ཞུན་མར་བསྲེས་པའི་སྦྱིན་སྲེག་བརྒྱད་བརྒྱ་བྱས་ན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱིའི་རིགས་ཀྱི་དངོས་གྲུབ་འཐོབ་སྟེ་ཐམས་ཅད་ཆོ་ག་ཆེན་པོ་ཞིབ་མོ་དང་།
en: He will accomplish the sameness of all tathāgata families.

source: སྦྱིན་སྲེག་ཆེན་པོའི་ཆོ་གར་འགྱུར་རོ།
en: This is a great rite, a great homa procedure in every respect. “

source: །དེ་ནས་ཕ་རོལ་གྱི་དམག་ཚོགས་གཞོམ་པར་འདོད་ན་རིག་སྔགས་འཆང་གཙང་མ་དེས་ཤིན་ཏུ་ཁྲུས་བྱས་ལ་གོས་གཙང་མ་བགོས་ཏེ་སེང་ལྡེང་གི་མེ་སྦར་ལ་ཞོ་དང་།
en: If the vidyā holder wants to uproot an enemy army, he should maintain ritual purity, bathe thoroughly, and wear clean clothes.

source: ཞུན་མར་དང་། ཡུངས་ཀར་དང་། གུ་གུལ་གྱི་སྲེག་བླུགས་ཀྱིས་སྦྱིན་སྲེག་བརྒྱད་སྟོང་བྱས་ན་དཔག་ཚད་སྟོང་ཚུན་ཆད་ཀྱི་ཕ་རོལ་གྱི་དམག་ཚོགས་བཅིང་བ་བྱས་པར་འགྱུར་རོ།
en: He should light a fire using sticks of cutch tree and offer one thousand and eight homas consisting of curds, ghee, mustard seeds, and bdellium.

source: །ཕ་རོལ་གྱི་དམག་ཚོགས་དང་།
en: Any foreign armies within the radius of one thousand leagues will be stopped. “

source: དགྲ་གཞོམ་པར་འདོད་པ་དང་། དཔུང་གཞིགས་པར་འདོད་ན་དེ་ནས་རིག་སྔགས་འཆང་གིས་ཤིང་ཀར་བ་ཀའི་མེ་སྦར་ལ། སྦྲུལ་གྱི་པགས་པ་བརྗེས་པ་དང་། སྐེ་ཙེའི་ས་བོན་དང་། ལན་ཚྭ་འབྲས་སཱ་ལུ་དང་བསྲེས་པ་ཡུངས་ཀར་མར་དང་སྦྱར་བའི་སྦྱིན་སྲེག་བྱས་ན་དཔག་ཚད་སྟོང་ཚུན་ཆད་ཀྱི་ཕ་རོལ་གྱི་དམག་ཚོགས་དང་།
en: If the vidyā holder wants to crush an enemy army and wipe out its troops, he should light the fire using oleander sticks and offer a homa consisting of a skin shed by a snake, datura seeds, salt, and rice grains mixed together and daubed in kaṭukā oil.

source: དགྲ་ལ་གནམ་ལྕགས་ཆེན་པོ་དང་། རླུང་གྲང་མོ་འབབ་པས་ཕོངས་པ་དང་།
en: The enemy armies within the radius of one thousand leagues will be ruined by great thunderstorms with hail and cold winds.

source: ཡིད་མི་བདེ་བ་བསྐྱེད་པར་འགྱུར། དགྲ་ཐམས་ཅད་རྣམ་པར་འཇིག་པར་འགྱུར་རོ།
en: Met with this calamity they will be destroyed, and all enemies will perish. “

source: །ཀླུས་ཆར་འབེབས་པར་འདོད་ན་རིག་སྔགས་འཆང་དེས་ཉིན་ཞག་གཅིག་སྨྱུང་བ་བྱས་ལ།
en: If the vidyā holder wants to cause nāgas to send rain, he should fast for one day and one night, bathe thoroughly, and maintain ritual purity.

source: ཤིན་ཏུ་ཁྲུས་བྱས་པ་གཙང་མས་དྲི་སྣ་ཚོགས་དང་། མེ་ཏོག་ཕྲེང་བ་དང་། ཡུངས་ཀར་དང་།
en: He should offer a homa consisting of various fragrances, flower garlands, mustard seeds, and śatapuṣpa daubed in ghee.

source: ཤ་ཏ་བུས་པ་ཞུན་མར་དང་སྦར་བའི་སྦྱིན་སྲེག་མཚན་གཅིག་ལ་དུས་གསུམ་དུ་བྱས་ན་ཀླུའི་རྒྱལ་པོས་ཆར་གྱི་རྒྱུན་ཆེན་པོ་འབེབས་ཏེ།
en: When he has done this at the three junctions of the night over the course of one night, the great nāga kings will release torrents of rain.

source: འཛམ་བུའི་གླིང་མཐའ་དག་ཏུ་ཞག་བདུན་གྱི་བར་དུ་ཆར་འབབ་པར་འགྱུར་རོ།
en: The rain will fall all over Jambudvīpa for seven days.

source: །ཆར་དེ་ཉིད་ཧ་ཅང་ཆེས་ན་ཐལ་བ་ནམ་མཁའ་ལ་གཏོར་ན་ཧ་ཅང་ཆར་ཆེས་པ་འཆད་པར་འགྱུར་རོ།
en: If it rains too much, the vidyā holder should cast some of the ashes left after the homa into the sky; this will stop the excessive rain. “

source: །ཡང་མེ་ལྷ་འོང་བར་འདོད་ཅིང་རང་གི་གཟུགས་སུ་མཐོང་བར་འདོད་ན་རིག་སྔགས་འཆང་གཙང་མ་དེས་གོས་གཙང་མ་བགོས་ལ་ཉིན་ཞག་གཅིག་གནས་པར་གྱུར་པས་ཤིང་སྣ་མའི་མེ་སྦར་ལ་འབྲས་སོ་བ་དང་།
en: If the vidyā holder wants to summon the fire deity in person and see him, he should purify himself ritually, put on clean clothes, and, having fasted for one night, light the fire using sticks of sumanas.

source: ཞུན་མར་དང་། བུ་རམ་ཤ་ཁར་དང་བཅས་པ་དང་། ཚ་བ་གསུམ་དང་། སྣ་མའི་མེ་ཏོག་བསྲེས་པ་བརྒྱད་སྟོང་སྦྱིན་སྲེག་བྱའོ། །བརྒྱད་སྟོང་ཚང་བ་དང་།
en: He should offer one thousand and eight homas consisting of rice grains mixed with ghee, sugar, molasses, the three spices, and jasmine flowers.

source: མེ་ལྷ་མེའི་ནང་ནས་ལུས་ཕྱེད་ཕྱུང་སྟེ་འདུག་ནས་རིག་སྔགས་འཆང་ལ་ཅི་བགྱི་བཀའ་སྩོལ་ཅིག་ཅེས་ཟེར་ཞིང་ཇི་ལྟར་རིག་སྔགས་འཆང་གི་ཆོ་གའི་དོན་དུ་འགྱུར་བ་དེ་བཞིན་དུ་སྨྲའོ།
en: When he has made one thousand and eight offerings, the fire deity will appear in its flaming body from within the fire. He will say to the vidyā holder, ‘Command me, vidyā holder!’ The vidyā holder should reply as he deems fit, telling the deity what tasks need to be performed.

source: །ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བ་མཆོག་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བ་བདུད་རྩི་འབར་བ་ཞེས་བྱ་བའི་མེའི་ཁ། ཁའི་མཆོག་སྦྱིན་པར་བྱེད་དོ།
en: The deity will grant him every boon. It will give him, from the tip of its mouth, the sacred agnimukha fire called immortal flame.

source: །གང་བདུད་རྩི་འབར་བའི་མེའི་ཁ་ཐོབ་པས་གང་དུ་དབུགས་ཕྱུང་བ་དང་།
en: Flames will then appear wherever the vidyā holder breathes out this agnimukha, this immortal flame.

source: རྔུབས་པ་དེར་མེ་འབར་བ་འབྱུང་བར་འགྱུར་རོ། །གང་དུ་ཕུ་ཞེས་བྱས་པ་དེར་མེ་འབྱུང་བར་འགྱུར་རོ།
en: Wherever he blows it out, fire will appear.

source: །མུན་གནག་ཏུ་དབུགས་ཕྱུང་ན་མེ་འབར་ཏེ། སྣང་བར་འགྱུར་རོ།
en: If he breathes while in darkness, fire will be seen. “

source: །ཙནྡན་དཀར་པོའི་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་པས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཉིད་ཀྱི་གཟུགས་སྟོན་པར་མཛད་དོ།
en: If the vidyā holder offers one thousand and eight homas of white sandalwood, Noble Avalokiteśvara will appear to him in person.

source: །ས་བོན་བདུན་གྱི་སྦྱིན་སྲེག་གིས་ནད་ཐམས་ཅད་ཞི་བར་བྱེད་དོ།
en: If he offers a homa consisting of seven citrons, all his diseases will depart.

source: །འབྲས་སོ་བའི་སྦྱིན་སྲེག་གིས་ནི་རྒྱལ་ནི་རྒྱལ་པོ་དབང་དུ་བྱེད་དོ།
en: To enthrall a king, he should offer a homa of rice grains.

source: །ཕུབ་མ་དང་ལན་ཚྭའི་སྦྱིན་སྲེག་གིས་ནི་ཞེ་འགྲས་པར་བྱེད་དོ།
en: He will sow enmity if he offers a homa of chaff and salt.

source: །འབྲས་ཡོས་དང་ཡུངས་ཀར་གྱི་སྦྱིན་སྲེག་གིས་ནི་སེམས་ཅན་ཐམས་ཅད་དབང་དུ་བྱེད་དོ། །ཡུངས་ཀར་དང་།
en: If he offers a homa of parched rice and mustard seeds, he will enthrall all beings.

source: གུ་གུལ་དང་། ཞུན་མར་གྱི་སྦྱིན་སྲེག་གིས་ནི་གནོད་སྦྱིན་འགུགས་སོ།
en: To summon a yakṣa, he should offer a homa of mustard seeds mixed with bdellium and ghee.

source: །ཀ་ར་བཱི་རའི་མེ་ཏོག་དང་། གུ་གུལ་ཞུན་མར་དང་སྦྱར་བའི་སྦྱིན་སྲེག་གིས་ནི་སྲིན་མོ་འགུགས་སོ།
en: To summon a rākṣasī, he should offer a homa of oleander flowers smeared with bdellium and ghee.

source: །དེ་བཞིན་དུ་འདིར་ལས་ཐམས་ཅད་བྱེད་དོ།
en: With a single performance he will accomplish all the tasks. “

source: །སྦྱིན་སྲེག་གི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའོ།། །།
en: This concludes the procedure of the homa maṇḍala. “

source: རི་མོའི་དཀྱིལ་འཁོར་གྱི་སྒྲུབ་པའི་ཆོ་ག་བཤད་པར་བྱ་སྟེ།
en: Now I will teach a maṇḍala practice procedure that involves a painting. It is suitable for performing any activity.

source: ཀུན་ཏུ་ཐུན་མོང་སྒྲུབ་པའི་མཆོག །དགེ་བའི་ལས་ཀུན་བྱེད་པ་སྟེ།
en: This universal practice is supreme in every respect and is the ultimate means of accumulating merit.

source: །སངས་རྒྱས་ཐམས་ཅད་མཐོང་འགྱུར་ཞིང་། །བླ་མེད་བསོད་ནམས་ཆེན་པོ་སོགས། །དོན་ཡོད་རྒྱལ་པོ་དེ་ཉིད་ནི། །རྣམ་པ་སྣ་ཚོགས་གཟུགས་དག་ཏུ། །འཇིག་རྟེན་འདྲེན་པ་སྣང་བར་བྱ། །མཐུན་དང་དངོས་གྲུབ་སྣ་ཚོགས་པའི།
en: It allows the vidyā holder to see all buddhas, and it reveals the true nature of Amogharāja, who appears as a guide for the world in various forms and under various names and can use his power to grant various magical abilities.

source: །འཇིག་རྟེན་འདྲེན་པའི་གཟུགས་བྱ་བ། །གྲུབ་པ་སྣ་ཚོགས་བྱེད་པའི་གནས། །སོ་སོའི་གཟུགས་སུ་བྱ་བ་ནི།
en: Individual forms of the guide of the world are the seat of and cause for various accomplishments. “

source: །རས་སམ་ཡང་ན་དར་དག་ལ། །འཇིགས་པ་མེད་པས་གཟུགས་བྱའོ།
en: The vidyā holder should skillfully draw Amogharāja’s form, either on cloth or on Chinese silk.

source: །དོན་ཡོད་པའི་རྒྱལ་པོ་ནི་ཁྲུ་གང་ཙམ་གྱི་ཚད་དམ་ཡང་ན་ཚད་ཤིན་ཏུ་རྣམ་པར་འབྱེད་པ་པདྨའི་མདོག་ལྟ་བུ་ཕྱག་བརྒྱད་པ། དབུ་གསུམ་པ།
en: He should be drawn one cubit tall, well proportioned, with eight arms, and having the color of a pink lotus.

source: དེ་བཞིན་དུ་སྤྱན་གསུམ་པ། ཞི་བའི་ཞལ་དུ་བྲི་བར་བྱ་སྟེ་དེ་བཞིན་དུ་ཞགས་པ་འཛིན་པ་དང་པདྨ་འཛིན་པ་དང་མདུང་རྩེ་གསུམ་པ་དང་།
en: Each of his three heads has three eyes and a gentle expression.

source: རིལ་བ་སྤྱི་བླུགས་འཛིན་པ་དང་། ཡིད་བཞིན་གྱི་ནོར་བུ་དང་། བེ་ཅོན་དང་དབུགས་འབྱིན་པ་དང་། བགྲང་ཕྲེང་དང་། མེ་ཏོག་ཐུམ་པོ་འཛིན་པར་བྱའོ།
en: He holds a noose, lotus, trident, water pot, wish-fulfilling jewel, and staff, a rosary held in one hand that is displaying the comforting mudrā, and a vase with flowers.

source: །གཡོན་དུ་ནི་དཀར་མོའོ།
en: To his left is Śvetā, and to his right is Noble Tārā.

source: །གཡས་སུ་འཕགས་མ་སྒྲོལ་མ་ཐལ་མོ་སྦྱར་ལ་དབུ་ཡིད་ཙམ་འདུད་བརྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའོ།
en: Both have bowed heads and folded hands and are adorned with every ornament.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ནི་རལ་པའི་ཐོར་ཚུགས་ཅན། དབུ་རྒྱན་འོད་དཔག་མེད་ཀྱིས་བརྒྱན་པ།
en: Noble Avalokiteśvara’s hair is in a topknot, adorned with a diadem, and crowned by Amitābha.

source: གཡས་ཕྱོགས་ཀྱི་དབུ་ཟླ་བ་ཚེས་པས་བརྒྱན་པ།
en: Above his right face is the crescent of a new moon.

source: རི་དགས་ཀྱི་པགས་པ་མནབས་པ། མཆོད་ཕྱིར་ཐོགས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། འོད་འདོམ་གང་དང་ལྡན་པའོ། །ནང་རིམ་དུ་པདྨའི་ཕྲེང་བའོ།
en: He wears an antelope skin and a sacred thread, and he is adorned with every ornament and surrounded by a halo of light that extends one fathom. “

source: །རིམ་པ་གཉིས་པར་རྡོ་རྗེ་ཕྲེང་བ་ལྕགས་ཀྱུ་དང་བཅས་པར་བྱའོ། །རིམ་པ་གསུམ་པར་ནོར་བུ་རིན་པོ་ཆེའི་ཕྲེང་བ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་མཛེས་པའོ། །རིམ་པ་བཞི་པར་མདུང་རྩེ་གསུམ་པའི་ཕྲེང་བའོ། །རིམ་པ་ལྔ་པར་ཀུན་ནས་འབར་བའི་ཕྲེང་བའོ།
en: The vidyā holder should draw five lines surrounding him: the inner line should consist of a row of lotuses; the second line, a row of vajra scepters with hooks; the third line, a row of jewels and gems; the fourth line, a row of tridents; and the fifth line, a halo of flames extending one fathom in all directions.

source: །སྟེང་དང་གཡས་ཕྱོགས་ཀྱི་གནས་སུ་དབང་པོ་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་མེ་ཏོག་སྣ་ཚོགས་ཐོགས་པར་བྱའོ། །གཡོན་དུ་གཞོན་ནུ་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་།
en: Above and to the right, he should draw Indra, Brahmā, Viṣṇu, and Maheśvara holding various flowers, and above and to the left, the powerful gods Kumāra, Yama, Varuṇa, and Kubera holding colorful flowers. “

source: ལུས་ངན་དང་། དབང་ཕྱུག་དང་། ལྷའི་བུ་རྣམས་བྱ་བ་ནི་མེ་ཏོག་སྣ་ཚོགས་ཐོགས་པར་བྱའོ། །ལྷ་མོ་སྒྲོལ་མའི་རྒྱབ་ཏུ་ཁྲོ་བོའི་རྒྱལ་པོ་དོན་ཡོད་པའི་ཞགས་པ་བྱ་བ་ནི་ཁྲོས་པ།
en: Behind the goddess Tārā, the vidyā holder should draw Amoghapāśa-Krodharāja in his wrathful, wild form.

source: གཏུམ་པའི་གཟུགས་འཆང་བ། ཕྱག་བཞི་པ། འབར་བའི་ནང་དུ་བཞུགས་པ། སྐུ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: He has four arms and a blazing black body adorned with all ornaments.

source: རལ་པ་འཆང་བ།
en: His hair is in a topknot and crowned with Amitābha.

source: འོད་དཔག་མེད་ཀྱི་དབུ་རྒྱན་ཅན། སྤྱན་གསུམ་པ། གཡས་པ་ཟླ་བས་བརྒྱན་ཅིང་རལ་གྲི་འཛིན་པ་དང་ཞགས་པ་འཛིན་པ་དང་། མདུང་རྩེ་གསུམ་པ་འཛིན་པ་དང་།
en: He has three eyes and is adorned with a crescent moon that is to Amitābha’s right. He holds a sword, a noose, a trident, and an axe.

source: དགྲ་སྟ་འཛིན་པར་བྱའོ། །དཀར་མོའི་རྒྱབ་ཏུ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་དབུ་གསུམ་པ་བྱ་བ་ནི། ཞི་བའི་ཞལ་རས་ཅན་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: Behind the goddess Śvetā, the vidyā holder should draw the three-headed Vidyārāja with a peaceful expression, adorned with all the ornaments.

source: དབུ་རྒྱན་རྒྱལ་བ་འོད་དཔག་མེད་ཅན་ཐོགས་པ། པདྨ་འཛིན་པ། ནོར་བུ་རིན་པོ་ཆེ་འཛིན་པར་བྱའོ། །འོག་ཏུ་ཕོ་ཉ་མོ་དང་། དབྱངས་ཅན་མ་དང་། དུང་ཅན་མ་དང་། དཔལ་མོ་དང་།
en: He wears a diadem adorned with the victorious Amitābha and holds a lotus and a precious great jewel. “

source: གནས་མ་དང་། དཔེ་མེད་མ་དང་། རལ་པ་གཅིག་མ་དང་། ཕོ་ཉ་མོ་ཞི་བ་དང་། ལོ་ཏོག་གི་ལྷ་དང་།
en: Below Amogharāja, the vidyā holder should draw Dūtī, Sarasvatī, Śaṅkhinī, Śrī, Vāsantī, Anaupamyā, Ekajaṭī, Śivadūtī, the deity of crops, and the goddess Pṛthivī.

source: སའི་ལྷ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་བྱའོ།
en: He should also draw the Four Great Kings.

source: སྟེང་དང་གཡས་གཡོན་དུ་སངས་རྒྱས་ཀྱི་སྐུ་གཟུགས་སྐྱིལ་མོ་ཀྲུང་བཅས་པ་སོར་བཞི་པའི་ཚད་ཙམ་བྱའོ། །ཉི་མ་དང་།
en: Above and to the right and left he should draw the figures of buddhas sitting cross-legged, each four fingers tall.

source: ཟླ་བའི་ལྷ་རྒྱུ་སྐར་དང་བཅས་པ་བྱའོ།
en: On the same canvas of fine cotton, he should also draw the deities Candra and Sūrya along with the nakṣatras.

source: །རི་མོའི་གཟུགས་ཀྱི་ཕྱི་རོལ་གྱི་རིམ་པ་ཀུན་དུ་ཕྱག་རྒྱ་དང་། ཕྱག་མཚན་སྣ་ཚོགས་རྫོགས་པར་བྲིའོ།
en: He should draw a closed outer circle of hands that display various mudrās and hold various implements.

source: ཀླུ་བརྒྱད་བྱ་ཞིང་ཀུན་ནས་འབར་བ་དང་བཅས་པར་བྱའོ།
en: There should be fifty-eight hands in all. All this should be surrounded by flames. “

source: །རིག་སྔགས་དངོས་གྲུབ་བླ་མེད་པའི། །རི་མོའི་ཆོ་གའི་གནས་འདི་ནི།
en: This painting procedure is the supreme basis for accomplishing the vidyā.

source: །སྡིག་པ་ཐམས་ཅད་མོད་ལ་སེལ། །མཚམས་མེད་ལྔ་པོ་སྦྱོང་བར་བྱེད།
en: It instantly removes all wrongdoings, including the five acts of immediate retribution.

source: །ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་བཅས་པ་རི་མོའི་གཟུགས་གྲུབ་པ་འདི་ནི་སྤྱིའི་རིགས་ཐམས་ཅད་དུ་འཇུག་པར་སྟོན་པ་ཡིན་ནོ།
en: Once it has been successfully executed, this painting with its mudrās and maṇḍala reveals and actualizes the sameness of all the families.

source: །ཕྱིའི་རིགས་ཐམས་ཅད་ཀྱི་དེ་ཁོ་ན་ཉིད་ཀྱི་རི་མོའི་དཀྱིལ་འཁོར་འདི་ནི་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་དང་། དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་བྱིན་གྱིས་བརླབས་པའོ།
en: It is blessed by the buddhas of the three times and by the bodhisattvas. This maṇḍala and painting truly embody the sameness of all the families.

source: །དོན་ཡོད་པའི་བྱིན་གྱི་བརླབས་ཀྱི་རི་མོ་འདི་ནི་ཐུབ་པ་རྣམ་པར་སྣང་མཛད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་སྟེ།
en: Blessed by the sage Vairocana, this painting bestows the amogha blessing.

source: དོན་ཡོད་པའི་ཞགས་པའི་དེ་ཁོ་ན་ཉིད་སྙིང་པོར་གྱུར་པ་དེ་ཁོ་ན་ཉིད་གསང་བ་འདི་མཐོང་བ་ཙམ་གྱིས་རྣམ་པར་ཐར་པ་འཐོབ་ཅིང་ལུང་བསྟན་པར་འགྱུར་རོ།
en: It truly manifests Amoghapāśa’s nature and secret essence. “Anyone who beholds this painting will be liberated and obtain the prophecy of their future awakening.

source: །མཐོང་བ་ཙམ་གྱིས་ཆོ་ག་ཞིབ་མོ་བླ་ན་མེད་པ་ཐམས་ཅད་འགྲུབ་བོ།
en: Merely by seeing it, they will win the supreme accomplishment of all rites.

source: །རྣམ་པར་སྣང་མཛད་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དང་ལྡན་པར་སྣང་བ་བྱེ་བ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་རོ། །དཀྱིལ་འཁོར་ཆེན་པོ་འཁོར་བཅས་ཀྱི། །རིག་སྔགས་ཆོ་ག་བླ་མེད་པ། །སྤྱི་རིགས་ཡང་དག་འབྱུང་བ་ནི།
en: They will come to see, face-to-face, the great maṇḍala-retinue of Vairocana that numbers hundreds of thousands of millions of billions, equaling the grains of sand in ninety-nine Gaṅgā rivers.

source: །ཐུབ་པ་རྣམ་སྣང་མཛད་ཀྱིས་བསྟན། །དེ་བཞིན་གཤེགས་རིགས་གྲུབ་པ་དང་། །གང་ཡང་པདྨའི་རིགས་དེ་བཞིན། །ནོར་རིགས་དེ་ཉིད་འབྱུང་བ་དང་། །རྡོ་རྗེའི་རིགས་གང་བླ་མེད་པ།
en: By this supreme vidyā rite, the rites of the unified buddha families—the tathāgata family, the lotus family, the true jewel family, and the supreme vajra family—are accomplished, as taught by the sage Vairocana.

source: །སྤྱི་རིགས་འདི་ཉིད་མཐོང་བ་ནི།
en: By beholding the painting, the vidyā holder perceives all families equally.

source: །རི་མོ་མཐོང་བའི་ཁྱད་པར་ཡིན།
en: This is what makes this rite special.

source: །ཕྱིར་ཡང་ངན་འགྲོར་མི་འགྲོ་ཞིང་། །དམྱལ་བ་ངན་འགྲོའི་སྒོ་བཅད་དེ།
en: He will not fall into lower realms or hell realms again.

source: །མཐོ་རིས་ཀྱི་ནི་སྒོ་ཡང་ཕྱེ། །བླ་ན་མེད་པ་སྟོན་པ་ཡི།
en: The doors that lead to the lower realms will close, while the doors to the heavenly realms will open.

source: །ཕྱག་རྒྱའི་རི་མོའི་དཀྱིལ་འཁོར་འདི། །བསོད་ནམས་བླ་ན་མེད་པ་ཡིན།
en: When he sees the maṇḍala’s supreme mudrās in the painting, he will accumulate supreme merit. “

source: །ཅི་སྟེ་དོན་ཡོད་པའི་འཇིག་རྟེན་དབང་ཕྱུག་གི་གཟུགས་མཐོང་བར་འདོད་ན་རིག་སྔགས་འཆང་དེས་ཙནྡན་དཀར་པོ་ལས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པ་སོར་བརྒྱད་ཀྱི་ཚད་ཙམ་ལ། གནད་ཀྱི་གནས་ཀྱི་ཆའི་སོར་ཚད་ཤིན་ཏུ་རྣམ་པར་མཛེས་པ། དབུ་དང་། མགུར་དང་།
en: If the vidyā holder wants to see the Lokeśvara in his amogha form, he should sculpt a figure of Noble Avalokiteśvara-Amoghapāśa out of sandalwood.

source: རྐེད་པ་དང་།
en: It should be eight fingers tall and well proportioned.

source: པུས་མོ་དང་།
en: It should be divided into sections, each a finger long, that correspond to his vital parts.
